station_list = [
    # SRT Stations
    "수서", "동탄", "평택지제", "천안아산", "오송", "대전", "김천(구미)", "동대구",
    "신경주", "울산(통도사)", "부산", "공주", "익산", "정읍", "광주송정", "나주", 
    "목포", "마산",

    # KTX Stations
    "행신", "서울", "영등포", "광명", "수원", "천안아산", "오송", "대전", "김천(구미)",
    "동대구", "경주", "울산(통도사)", "부산", "구포", "밀양", "포항", "서대구", "공주",
    "익산", "정읍", "광주송정", "나주", "목포", "여수엑스포", "순천", "전주", "남원",
    "구례구", "하동", "진주", "마산", "창원중앙", "창원", "진영", "삼랑진", "안동",
    "영주", "제천", "단양", "풍기", "영월", "태백", "동해", "강릉", "평창", 
    "진부(오대산)", "횡성", "둔내", "만종", "원주", "서원주", "제천", "영월", 
    "태백", "동해", "강릉"
]
